import React from "react";
import Container from "../compontents/Container";
import AvatarTitle from "../compontents/AvatarTitle";
import CardList from "../compontents/CardList";
import PageTitle from "../compontents/PageTitle";

export default function MelodyHorizontalRules() {
    return (
        <div className="w-full">
            <PageTitle
                title="قواعد اللحن الافقي C.F"
                subTitle="هذه قواعد اللحن الافقي C.F التي يجب معرفتها"
                iconSrc="icons/ruler.svg"
            />
            <Container>
                <AvatarTitle
                    title="سمى اللحن الأساسي Contsfirmo ويرمز له C.F وهو أن يبدأ بدرجة أساس السلم أو المقام وينتهي بنفس الدرجة مسبوقة بالدرجة الثانية"
                    avatar="illustrations/rules1.png"
                />
                <div className="grid grid-cols-2 gap-x-8 gap-y-4">
                    <CardList
                        list={[
                            "يبدأ  اللجن الافقي c.f بنغمة الأساس للمقام وينتهي بنغمة الأساس مسبوقة بنغمة الدرجة الثانية للمقام.",
                            "البداية والنهاية: إذا كان لحن الكنتربوينت في الأعلى فيبدأ بنغمة اليونسون Unison أو الأوكتاف Octave أو الخامسة وينتهي بالصوت الأساسي اليونسون Unison أو أوكتاف Octave مسبوقاً بنغمة الدرجة السابعة (الحساس) اما اذا كان لحن الكنتربوينت في الأسفل فيبدأ بنغمة يونسون أو الأوكتاف فقط وينتهي بالصوت الأساسي يونسون أو أوكتاف مسبوقاً بنغمة الدرجة السابعة (الحساس).",
                        ]}
                    />
                    <CardList
                        list={[
                            "المسافات المسموحة عند تكوين اللحن الأفقي: مسافة الثانية الكبيرة والصغيرة، مسافة الثالثة الكبيرة والصغيرة، مسافة الرابعة التامة، مسافة الخامسة التامة، ومسافة الثامنة التامة ومسافة السادسة الصغيرة على ان تهبط مسافة ثانية صغيرة.",
                            "ممنوع استخدام مسافة السادسة الكبيرة، السابعة الكبيرة والصغيرة، مسافة التاسعة الكبيرة والصغيرة، جميع المسافات الزائدة والناقصة لأنها مسافة متنافرة",
                        ]}
                    />

                    <CardList
                        list={[
                            " تجنّب الخامسات أو الأوكتافات المتوازية وتجنّب الخامسات أو الأوكتافات المخفية. ",
                            " تجنّب التحرّك بالتوازي في الثالثة أو السادسة لأكثر من ثلاث مرات متتالية. ",
                            "تفاد المسافات المتنافرة بين أيّ نغمتين: الثانية الكبيرة 2nd M أو الثانية الصغيرة 2nd m، السابعة الكبيرة والصغيرة7th M m ، وأيّ مسافة زائدة Augmented أو ناقصة Diminished. ",
                        ]}
                    />

                    <CardList
                        list={[
                            "تجنب استخدام التآلفات المفككة Broken Chords.",
                            " تجنب تكرار التتابعات اللحنية Sequential Repetition على بعد مسافة ثانية أو ثالثة أو رابعة سواء صعوداً أو هبوطاً. ",
                            "	 استخدام قفزة الأوكتاف في حالات ملحة وضرورية منها:",
                            " إذا تجاوز أو تخطى اللحن نطاقه الصوتي.",
                            "إذا ضاقت المسافة الرأسية بين اللحنين (النغمتين المتقابلتين).",
                        ]}
                    />
                    <CardList
                        list={[
                            "إذا اتسعت المسافة الرأسية بين اللحنين (النغمتين المتقابلتين).",
                            "وفى جميع الحالات لا يسمح بالقفزة لأكثر من مسافة اكتاف.",
                            " يمكن استخدام قفزتان متتاليتان في اتجاه واحد أو أن القفزة الثانية تكون عكس الاتجاه لمسافتي الرابعة والخامسة فقط.",
                            " عند استخدام قفزة الأوكتاف يفضل أن يليها حركة سلمية عكس الاتجاه وفى جميع الأحوال لا تزيد القفزة عن قفزة الثالثة عكس اتجاه قفزة الأكتاف. ",
                            " المسافات اللحنية التي توضع بحذر هي مسافة الثانية والسابعة والرابعة، وعند سير اللحنين معا لابد من مراعاة الآتي:",
                            "تجنب تعاقب مسافة الأوكتاف مباشرة نفس المسافة في شكل متوازي، وكذلك مسافة الخامسة.",
                        ]}
                    />
                    <CardList
                        list={[
                            "مسموح باستخدام مسافة الثالثة أو السادسة المتوازية ولكن يفضل استخدام الحركة المماثلة لفترة طويلة",
                            " يسمح بتوازي أكثر من ثلاث مرات متعاقبة سواء لمسافة الثالثة أو السادسة.",
                            "الحركة العكسية وهي أفضل الحركات اللحنية بين الصوتين وفيها صوت يتحرك إلى أعلى والصوت المقابل يتحرك إلى أسفل.",
                            "الحركة المماثلة وهي تحريك أحد الأصوات بينما الصوت الآخر ثابت.",
                            "لا يسمح بتخطي نطاق الصوت الأخر فالصوت الأعلى لا يتخطى الصوت الأسفل والعكس. ",

                            "هناك خمس أنواع للكنتربوينت المقيد Strike Counterpoint يتم تحديدها حتى يتمكن الدارس من الإلمام بهذا الفن والتمكن من صياغة الألحان الكونترابنطية. ",
                        ]}
                    />
                </div>
            </Container>
        </div>
    );
}
