import React from "react";
import Container from "../../compontents/Container";
import PageTitle from "../../compontents/PageTitle";
import AvatarTitle from "../../compontents/AvatarTitle";
import CardList from "../../compontents/CardList";
import Card from "../../compontents/Card";
import Illustration from "../../compontents/Illustration";

export default function Type4() {
  return (
    <div className="w-full">
      <PageTitle
        title="انواع الكونتربوينت"
        subTitle="النوع الرابع (السنكوب)"
        iconSrc="icons/shapes.svg"
      />
      <Container>
        <AvatarTitle
          title="النوع الرابع (السنكوب)"
          avatar="illustrations/rules1.png"
        />
        <Card>
          نغمة مقابل نغمتين، بناء هذا النوع مثل بناء النوع الثاني على نغمة من
          لحن C.F تقابلها نغمتين من لحن C.P ولكن باستخدام الرباط الزمني حيث تقع
          نغمة لحن C.P نصفها الأول على الضغط الضعيف المقابل لنغمة لحنC.F، والنصف
          الأخر على الضغط الأول مقابل النغمة التالية في لحن C.F، وهذا ما يسمى
          الضغط المؤخر Syncopation، وعندما تكون النغمة المربوطة متنافرة لابد أن
          تهبط درجة إلى أسفل وإذا كانت متوافقة فيتحرك لحن C.P بحرية إلى نغمة
          متوافقة مع نغمة لحن C.F
        </Card>
        <div className="grid grid-cols-2 gap-x-8">
          <CardList
            list={[
              "وهناك اعتبارات يجب مراعاتها في النوع الرابع هي",
              "البداية تكون سكتة بقيمة نصف مازورة، ثم نغمة بلانش مربوطة مع المازورة التي تليها",
              "المازورة الأخيرة يجب أن تكون روند مقابل روند ويسبقها نغمة بلانش غير مربوطة",
              "نغمة البلانش الأولى في كل مازورة يمكن أن تكون على شكلين",
            ]}
          />
          <CardList
            list={[
              "تكون النغمة متوافقة وبالتالي يتبعه حركة غير متصلة",
              "تكون النغمة متنافرة وبالتالي يهبط بدرجة متصلة أو نصف درجة نحو النغمة الأساسية من التآلف على الزمن الثاني",
              "يمنع استخدام السنكوب في مسافة الثانية تليها يونيسون",
              "مسافة الخامسة والأكتاف ممنوعة على البلانش الثاني مسموعة فقط على البلانش الأول",
              "البناء اللحني للصوت العلوي يكون (7-6-8)",
            ]}
          />
          <CardList
            list={[
              "هناك بعض الاستثناءات يمكن إتباعها هي :",
              "يجوز في بعض الحالات كسر السنكوب لمرة واحدة فقط في التمرين ويمكن استعمال نغمتا بلانش مختلفات وبدون ربط على أن تكونا هاتان النغمتان نغمات متوافقة ويمكن أن تأتي أول المازورة أو وسطها أو في النهاية",
              "يجوز البدء في المازورة الثانية، ولكن يحبذ استعمال المازورة الأولى",
              "يجوز استخدام العبور أو التقاطع (Crossing) لفترة قصيرة نغمتين أو ثلاثة فقط إذا كان هناك مبررات نغمية ولمرة واحدة في التمرين على ألا تكون في بداية التمرين أو نهايته. ( محمد الملاح -2010- ص44, 45)",
            ]}
          />
          <Illustration
            src="notes/image019.jpg"
            desc="مثال النوع الرابع (السنكوب)"
          />
        </div>
      </Container>
    </div>
  );
}
