import React from "react";
import Container from "../../compontents/Container";
import PageTitle from "../../compontents/PageTitle";
import AvatarTitle from "../../compontents/AvatarTitle";
import CardList from "../../compontents/CardList";
import Card from "../../compontents/Card";
import Illustration from "../../compontents/Illustration";

export default function Type5() {
  return (
    <div className="w-full">
      <PageTitle
        title="انواع الكونتربوينت"
        subTitle="النوع الخامس (الكونتربوينت المزخرف)"
        iconSrc="icons/shapes.svg"
      />
      <Container>
        <AvatarTitle
          title="النوع الخامس (الكونتربوينت المزخرف)"
          avatar="illustrations/rules1.png"
        />
        <Card>
          وهو نغمة مقابل مجموعة نغمات تختلف في أشكالها الإيقاعية ولكن تتمثل في
          مجموعها زمن نغمة لحن C.F، بمعنى أن هذا النوع هو خليط من الأنواع
          الأربعة، بالإضافة الى استخدام العلامات الزمنية المنقوطة والوحدات
          الأصغر زمناً، ولكن رغم تلك الإضافات
        </Card>
        <div className="grid grid-cols-2 gap-x-8">
          <CardList
            list={[
              "فقد وضعت لهذا النوع شروطا وقواعد لاستخدام هذا النوع بالتحديد أهمها: ",
              "عند استخدام الرباط الزمني بالتأخر، لابد أن يكون زمن النغمة المربوطة على الضغط القوى أكبر من زمن النغمة التي ربطت منها على الضغط الضعيف أو متساوية معها في الزمن",
              "عند استخدام الأشكال الأصغر زمنا فيجب أن تكون على الضغط الضعيف وتكون في شكل مروري Passing note أو تغيير Changing note",
              "يفضل استخدام العلامات المنقوطة على ضغط قوى حتى يعطى نوع من أنواع تأخير النبر الضعيف وهذا ما يعطى اللحن الأفقي ثراءً إيقاعياً ونغمياً",
              "يستعمل الكرش مزدوج وليس بشكل منفرد، حيث يكون بمثابة نوار ويستعمل في الضلع الثاني أو الرابع في المازورة",
            ]}
          />
          <CardList
            list={[
              "يجب استعمال في هذا النوع وفي كل مازورة نوع خاص أو إيقاع مختلف، فعلى سبيل المثال عند استعمال مازورة تحوي على اثنين من البلانشات فبالتالي لا يجوز استعمالها مرة ثانية في مازورة أخرى، على أن يتم المحافظة على إتباع القوانين الخاصة بكل نوع",
              "تخضع الكروشات لقوانين النوع الثالث أي يأتي الكرش الأول بصورتين هما",
              "نوتة متوافقة فتكون لها حرية الحركة أو يونيسون",
              "نوتة متنافرة فلابد أن تأتي في صورة مرورية",
              "الحركة بين الكروشين يجب أن تكون متصلة، بدون قفزات",
            ]}
          />
          <Illustration
            src="notes/image021.jpg"
            desc="مثال النوع الخامس (الكونتربوينت المزخرف)"
          />
        </div>
      </Container>
    </div>
  );
}
